const APP_NAME = 'بدع حديثة حول الكتاب المقدس';
const QUOTE =
    'كُلُّ الْكِتَابِ هُوَ مُوحًى بِهِ مِنَ اللهِ،\n وَنَافِعٌ لِلتَّعْلِيمِ وَالتَّوْبِيخِ، لِلتَّقْوِيمِ وَالتَّأْدِيبِ\n الَّذِي فِي الْبِرِّ';
const QUOTE_DECORATED = '" $QUOTE "';
const GUIDE = '2 تي 3: 16';
const GUIDE_DECORATED = '($GUIDE)';
const PROGRAM = 'البرنامج';
const MAIN_SONG = 'الشعار';
const SONGS = 'الالحان';
const FATHERS_SAY = 'اقوال اباء';
const FATHERS_SAY_HOLY = 'اقوال اباء عن الكتاب المقدس';
const SONGS2 = 'الترانيم';
const DAY_1 = 'اليوم الاول';
const DAY_2 = 'اليوم التاني';
const DAY_3 = 'اليوم الثالث';

const PRIVACY_POLICY = 'Privacy Policy';
const TIME_KEY = 'time';
const TITLE_KEY = 'title';
const BODY_KEY = 'body';
const DETAILS_KEY = 'details';

const NAME_KEY = 'time';
const QUOTE_KEY = 'title';
const PIC_KEY = 'details';

const DAY_1_MAP = [
  {
    TIME_KEY: '09:00 - 10:00',
    TITLE_KEY: 'استلام الغرف',
    DETAILS_KEY: '',
  },
  {
    TIME_KEY: '10:00 - 10:15',
    TITLE_KEY: 'صلاة',
    DETAILS_KEY: '',
  },
  {
    TIME_KEY: '10:15 - 10:30',
    TITLE_KEY: 'عرض البرنامج',
    DETAILS_KEY: '',
  },
  {
    TIME_KEY: '10:30 - 11:00',
    TITLE_KEY: 'ترانيم وألحان',
    DETAILS_KEY: '',
  },
  {
    TIME_KEY: '11:00 - 12:00',
    TITLE_KEY: 'العنف فى الكتاب المقدس',
    DETAILS_KEY: 'ابونا يوسف سمير',
  },
  {
    TIME_KEY: '12:00 - 12:15',
    TITLE_KEY: 'شاي',
    DETAILS_KEY: '',
  },
  {
    TIME_KEY: '12:15 - 12:45',
    TITLE_KEY: 'اقوال ومعانى',
    DETAILS_KEY: '',
  },
  {
    TIME_KEY: '12:45 - 01:00',
    TITLE_KEY: 'ترانيم وألحان',
    DETAILS_KEY: '',
  },
  {
    TIME_KEY: '01:00 - 02:00',
    TITLE_KEY: 'قواعد عامه فى الرد على اعتراضات الكتاب المقدس',
    DETAILS_KEY: 'ابونا متى بديع',
  },
  {
    TIME_KEY: '02:00 - 05:00',
    TITLE_KEY: 'غذاء وراحة',
    DETAILS_KEY: '',
  },
  {
    TIME_KEY: '05:00 - 06:00',
    TITLE_KEY: 'صلاة الغروب والنوم',
    DETAILS_KEY: '',
  },
  {
    TIME_KEY: '06:00 - 06:15',
    TITLE_KEY: 'ترانيم وألحان',
    DETAILS_KEY: '',
  },
  {
    TIME_KEY: '06:15 - 06:45',
    TITLE_KEY: 'اقوال ومعانى',
    DETAILS_KEY: '',
  },
  {
    TIME_KEY: '06:45 - 08:00',
    TITLE_KEY: 'هل الكتاب المقدس من اساطير الاولين',
    DETAILS_KEY: 'استاذ عصام نعيم',
  },
  {
    TIME_KEY: '08:00 - 08:30',
    TITLE_KEY: 'عشاء',
    DETAILS_KEY: '',
  },
  {
    TIME_KEY: '08:30 - 10:30',
    TITLE_KEY: 'موضوع للمناقشة',
    DETAILS_KEY: '',
  },
];

const DAY_2_MAP = [
  {
    TIME_KEY: '08:00 - 08:30',
    TITLE_KEY: 'صلاة باكر',
    DETAILS_KEY: '',
  },
  {
    TIME_KEY: '08:30 - 09:00',
    TITLE_KEY: 'فطار',
    DETAILS_KEY: '',
  },
  {
    TIME_KEY: '09:00 - 09:15',
    TITLE_KEY: 'ترانيم وألحان',
    DETAILS_KEY: '',
  },
  {
    TIME_KEY: '09:15 - 10:15',
    TITLE_KEY: 'هل العلم والتطور ضد الكتاب المقدس',
    DETAILS_KEY: 'استاذ عصام نسيم',
  },
  {
    TIME_KEY: '10:15 - 10:30',
    TITLE_KEY: 'شاي',
    DETAILS_KEY: '',
  },
  {
    TIME_KEY: '10:30 - 11:00',
    TITLE_KEY: 'اقوال ومعانى',
    DETAILS_KEY: '',
  },
  {
    TIME_KEY: '11:00 - 12:00',
    TITLE_KEY: 'التفاسير الابائية للكتاب المقدس',
    DETAILS_KEY: 'الحبر الجليل الانبا زوسيما',
  },
  {
    TIME_KEY: '12:00 - 12:30',
    TITLE_KEY: 'شاي وراحة',
    DETAILS_KEY: '',
  },
  {
    TIME_KEY: '12:30 - 12:45',
    TITLE_KEY: 'ترانيم',
    DETAILS_KEY: '',
  },
  {
    TIME_KEY: '12:45 - 02:00',
    TITLE_KEY: 'ورشة عمل',
    DETAILS_KEY: '',
  },
  {
    TIME_KEY: '02:00 - 05:00',
    TITLE_KEY: 'غذاء وراحة',
    DETAILS_KEY: '',
  },
  {
    TIME_KEY: '05:00 - 06:00',
    TITLE_KEY: 'صلاة عشية',
    DETAILS_KEY: '',
  },
  {
    TIME_KEY: '06:00 - 07:00',
    TITLE_KEY: 'رياضة',
    DETAILS_KEY: '',
  },
  {
    TIME_KEY: '07:00 - 07:15',
    TITLE_KEY: 'ترانيم والحان',
    DETAILS_KEY: '',
  },
  {
    TIME_KEY: '07:15 - 08:15',
    TITLE_KEY: 'قداسة العهد القديم',
    DETAILS_KEY: 'ابونا رفائيل ثروت',
  },
  {
    TIME_KEY: '08:15 - 08:45',
    TITLE_KEY: 'عشاء',
    DETAILS_KEY: '',
  },
  {
    TIME_KEY: '08:15 - 10:15',
    TITLE_KEY: 'تسبحة نصف اليل',
    DETAILS_KEY: '',
  },
];

const DAY_3_MAP = [
  {
    TIME_KEY: '07:00 - 10:30',
    TITLE_KEY: 'القداس',
    DETAILS_KEY: '',
  },
  {
    TIME_KEY: '10:30 - 11:00',
    TITLE_KEY: 'الفطار',
    DETAILS_KEY: '',
  },
  {
    TIME_KEY: '11:00 - 11:30',
    TITLE_KEY: 'كلمة سيدنا',
    DETAILS_KEY: '',
  },
  {
    TIME_KEY: '11:30 - 01:00',
    TITLE_KEY: 'موضوع للمناقشة',
    DETAILS_KEY: '',
  },
  {
    TIME_KEY: '01:00 - 02:00',
    TITLE_KEY: 'توصيات وختام',
    DETAILS_KEY: '',
  },
];

const SONGS_LIST = [
  'ذكصولوجية عيد النيروز',
  'لحن أيها الرب إله القوات',
  'لحـــــــــــــــــن بي نيشتي',
  'إبصالية آدام لعيد النيروز'
];

const SONGS2_LIST = [
  'كنيستنا دى قصة اجيال',
  'كنيستي القبطية',
  'كنيستي أرجو لكي',
  'مفيش أحلى منها ساعة الصلاة',
  'ليتك تباركني',
  'ما احلاكِ يا كنيستنا',
  'الشهداء حبوك',
  'يا كنيستنا يا مجيدة',
  'كم قسى الظلم عليكي',
  'أعروس الفادي',
];

const FATHERS_SAY_DETAILS = [
  {
    NAME_KEY: 'القديس العظيم الانبا انطونيوس',
    QUOTE_KEY: 'اتعب نفسك في قراءة الاسفار المقدسة فهي تخلصك من النجاسة',
    PIC_KEY: 'assets/images/pic1.jpg',
  },
  {
    NAME_KEY: 'القديس غريغوريوس الكبير',
    QUOTE_KEY:
        'ان كتاب الله نهر فيه يمكن ان يعوم الفيل كما انه يمكن ان يعبره الحمل الصغير',
    PIC_KEY: 'assets/images/cross.jpg',
  },
  {
    NAME_KEY: 'القديس يوحنا ذهبي الفم',
    QUOTE_KEY:
        'من يعرف الكتاب المقدس حق المعرفة لن يتعثر في شيء بل سيحتمل كل شيء بصبر و نبل',
    PIC_KEY: 'assets/images/pic3.jpg',
  },
  {
    NAME_KEY: 'القديس اوغسطينوس',
    QUOTE_KEY:
        'الكتاب المقدس هو سيف الانتصار على فيض الخلاعة التي اوشكت ان تقضي على الاداب المسيحية',
    PIC_KEY: 'assets/images/pic4.jpg',
  },
  {
    NAME_KEY: 'القديس جيروم',
    QUOTE_KEY: 'اذا احببت كتابك المقدس فلن تكمل بعد شهوة الجسد',
    PIC_KEY: 'assets/images/pic5.jpg',
  },
  {
    NAME_KEY: 'القديس مار اسحق السرياني',
    QUOTE_KEY: 'قراءة الكتاب المقدس تنير العقل و تعلم النفس الحديث مع الله',
    PIC_KEY: 'assets/images/pic6.jpg',
  },
  {
    NAME_KEY: 'القديس امبروسيوس',
    QUOTE_KEY: 'نخاطب الرب اذ نصلي و نصغي اليه اذ نقرأ الكتاب المقدس',
    PIC_KEY: 'assets/images/pic7.jpg',
  },
];

const MAIN_SONG_DETAILS =
    '(على وزن شوفت في الكنيسة)\nالقرار: كتابي مكتوب لحياتي مطلوب\nاتعلم واعلم واغير قلوب\n\n1- ابارك وأشارك كل كل الناس\nافرح قلب يسوع ادعوا للخلاص\n\nكتابي مكتوب لحياتي مطلوب\nاتعلم واعلم واغير قلوب\n\n2- أثمر ثمرات ادعوا للصلوات\nهدفي الملكوت حتى لو اموت\n\nكتابي مكتوب لحياتي مطلوب\nاتعلم واعلم واغير قلوب\n\n3- كل طاعتي ليه ده سالمي فيه\nيارب خليني ما الجأ الا ليه\n';

const SO2_1 =
    '(كنيستنا دى قصة اجيال ابطالهم كانوا ابطال)2\n(ابناها شهداء ابرار برضاهم حربوا الاشرار )2\n\nوصلاتهم ليل مع نهار شالوا عنها كل الاخطار\nكنيستنا كنيستنا كنيستنا دى قصة اجيال ابطالهم كانو ابطال \n\n(بجهاد وتعب مع دموع اضائو احلى الشموع)2\n(بصمودهم ويا ايمانهم نوروا طريق يسوع)2\n\nبدماهم سقوا كل مكان الصليب عالى مرفوع\nكنيستنا كنيستنا كنيستنا دى قصة اجيال أبطالهم كانو ابطال\n\n (احتملو اقصى الالامات بالفرح قبلو الاهانات)2\n(وسط التعزيب والجراحات الدم مالا السحاب)2\n\nوالموت بالنسبالهم كان كالقيامة من الاموات\nكنيستنا كنيستنا كنيستنا دى قصة اجيال أبطالهم كانو ابطال\n\n ';
const SO2_2 =
    '1- كنيستي القبطية كنيسة الإله قديمة قوية أرجوا لها الحياة\nفي أول العصور لمولد المسيح مرقس أتى بنور إيمانه الصحيح\nوجال في البلاد ينادي بالخلاص باسم يسوع الفادي من يرفع القصاص\n\n2- فآمن الأقباط بربنا يسوع وحل الاغتباط في كافة الربوع\nفي أمد قريب قدد حطموا الأوثان وارتفع الصليب وراية الإيمان\nإبليس حالاً قام يحارب ابن الله فهيج الحكام والجند والولاة\n\n3- فاشهروا السلاح على بني الإيمان هيا انكروا المسيح أو تلقوا في النيران\nأباؤنا الكرام كبار مع صغار لم يثنهم آلام أو شدة أو عار\nبل قالوا بانتصار للخلف لا رجوع لا نجزع من نار ... إلهنا يسوع\n\n4- كم ضربوا كم سجنوا كم عاشوا في اكتئاب كم قتلوا كم حرقوا كم ذاقوا من عذاب\nبقوة اليقين قد غلبوا الآلام وداموا ثابتين في ملك السلام\nبالدم والعناء قد اشتروا الإيمان واحتفظوا لنا باسم الفادي الرحمن\n\n5- هيا بنا نقوم من شدة الكسل وللعلي نروم ونسعى بالعجل\nكنيسة الآباء أنت فخرنا إلى نجاحها هيا هيا بنا\nكنيستي القبطية إيمانها صحيح إلى الأبد قوية يا مصر للمسيح\n\n';
const SO2_3 =
    '1- كنيستي أرجو لك من عزة الإله\nخلاص كل الشعب يا سفينة النجاة\n\nعد يا إلهي واتطلع وانظر من السماء\nتعهدت الكرم بالخصب وبالنماء\n\n2- ليحفظ الرب لك عهداً على الدوام\nوليملأ الإله أبراجك بالسلام\n\nعد يا إلهي واتطلع وانظر من السماء\nتعهدت الكرم بالخصب وبالنماء\n\n3- أطلب راحة لك في قصرك الرحب\nدوماً لأجل إخوتي والأهل والصحب\n\nعد يا إلهي واتطلع وانظر من السماء\nتعهدت الكرم بالخصب وبالنماء\n\n4- من أجل بيت الله أطلب لك الخيرات\nملتمساً فوزاً لك من مصدر القوات\n\nعد يا إلهي واتطلع وانظر من السماء\nتعهدت الكرم بالخصب وبالنماء\n\n5- أنت إلهنا القوي المنجد المعين\nعونك ملجأ لنا وحصننا الحصين\n\nعد يا إلهي واتطلع وانظر من السماء\nتعهدت الكرم بالخصب وبالنماء\n\n';
const SO2_4 =
    '1- مافيش أحلى منها  ساعة الصلاة لله\nتنجيني من ضيق الشديد وأنال بها رضاه\n\n 2- تبعد عنى التعب وتنور لي قلبي\nوتفتح لي باب السماء ويسمعني ربي\n\n 3- حاجاتي يقضيها أمراضي يشفها\nيعطيني كل أعوازي ويمتعني بها\n\n 4- في ساعة أحزاني ربى لا ينساني\nيمسكني باليد اليمين ويثبت إيماني\n\n 5- ما فيش حلى منها ساعة الصلاة لله\nيفرح بها رب السما ويعطيني الحياة\n\n 6- وعدنا بالخلاص ان كنا نصلى له\nأمراضنا يقدر يشفها أن كنا نيجي له\n\n';
const SO2_5 =
    'ليتك تباركنى وتوسع تخومى \n وتكون يدك معى تحفظنى من الشر\nحتى لا يتعبنى\n\nليتك تشاركنى فلى فرحى وهمومى\n  وتكون يدك معى تحفظنى من الكرب\nحتى لا يتعبنى\n\nليتك تحررنى من ظلمة العقل\nوتكون يدك معى تحفظنى من الفكر\nحتى لا يتعبنى\n\nليتك تثبتنى فى رجائى وايمانى \n   	وتكون يدك معى تحفظنى من الشك\nحتى لا يتعبنى\n\n';
const SO2_6 =
    '1- ما أحلاك يا كنيستنا وما أحلى أسرارك\nشمعه فى طريقنا بيها نتبارك(2)\n\n2- الشهداء أولادك فدوك بدمهم\nو احنا صغارك نعمل زيهم(2)\n\n3- لما ندخلك نرشم الصليب\nقدام هيكلك نسجد للحبيب(2)\n\n4- وسط قداسك نرفع  قلوبنا\nنرنم ألحانك ننسى همومنا(2)\n\n5- فيك العذراء مريم أم المؤمنين\nقدمت لينا فادى العالمين(2)\n\n6- فيك أسطفانوس أول الشهداء\nفيك الأنبا بطرس خاتم الشهداء(2)\n\n7- فيك مارمرقس كاروزنا الحبيب\nفيك مارجرجس أمير الشهداء(2)\n\n8- فيك الأنبا أنطونيوس أول الرهبان\nفيك الأنبا بولا أول السواح(2)\n\n';
const SO2_7 =
    'الشهداء حبوك علشان هما ذاقوك\nحلو حلو حلو حلو أنت يا رب\n\n1- ما هياش جرأة وشجاعه دى قلوبهم كانت مولعه\nبحب فاديهم يسوع اللى على الصليب مرفوع\nأكلوا جسدة شربوا دمه عاش فيهم وهم فيه\n\n الشهداء حبوك علشان هما ذاقوك\nحلو حلو حلو حلو أنت يا رب\n\n2- بحبك أنت أغنيتهم شبعت كل عواطفهم\nلما مليت كل أذهانهم بكلامك وقربك منهم\nريحتهم فرحتهم وف آلامهم جيت عزيتهم\n\n الشهداء حبوك علشان هما ذاقوك\nحلو حلو حلو حلو أنت يا رب\n\n3- اسمعوا يا ناس وانتبهوا ذوقوا وانظروا ما أطيبة\nحلقة حلاوة ومشتهيات ياللا يا ناس عوضوا اللى فات\nلو ذقتوة و تعرفوا ليه الشهداء زمان ما تركوة\n\nالشهداء حبوك علشان هما ذاقوك\nحلو حلو حلو حلو أنت يا رب\n\n';
const SO2_8 =
    'يا كنيستنا يا مجيدة \nكل ما فيكِ جميل\n جوهرة في الكون فريدة\n(غالية مالهاش مثيل)٢\n\n ١.البخور فيكِ حايطنا\nفي صعوده للعلا\nعاالدوام يرفع صلاتنا\nللمسيح رب الفدا\nيا لطفته ريحته حلوة\nتنعش الصدر العليل\nوالقلوب تشعر بنشوة\n(لما ناحيتها تميل)٢\n\nيا كنيستنا يا مجيدة \nكل ما فيكِ جميل\n جوهرة في الكون فريدة\n(غالية مالهاش مثيل)٢\n\n٢. يا جمال المنجلية\nواقفة بين الشمعتين\nليها تتوجه عينيّ\nفيها بهجة لكل عين\nبأبقى متهيألي إني\nمع الهنا في أورشليم\nفي هدوء بأخد فوائد\n(من كلام ربي العظيم)٢\n\nيا كنيستنا يا مجيدة \nكل ما فيكِ جميل\n جوهرة في الكون فريدة\n(غالية مالهاش مثيل)٢\n\n٣.الصور قدام عينينا\nليها ننظر في حنين\nجايبة للحاضر ماضينا\nوالآباء القديسين\nأدي بينا مار جرجس\nمَثل الجندي الشجاع\nأدي بينا أنبا أنطونيوس\n(أب لكل الرهبان)٢\n\nيا كنيستنا يا مجيدة \nكل ما فيكِ جميل\n جوهرة في الكون فريدة\n(غالية مالهاش مثيل)٢\n\n٤. يا كنيستنا مهما أشرح\nفي كلام وافي طويل\n مستحيل أني أوضح\nكل حسنك مستحيل\nكل ناحية روعة فيكِ\nكل شئ معناه جليل\nوالبيان من مجاميعه\n (عمره ما يشفي الغليل)٢\n\nيا كنيستنا يا مجيدة \nكل ما فيكِ جميل\n جوهرة في الكون فريدة\n(غالية مالهاش مثيل)٢\n\n';
const SO2_9 =
    'كم قسى الظلم عليكي كم سعى الموت إليك\nكم صدمت باضطهادات و تعذيب و ضنك\n\n1- كم جرحت كيسوع بمسامير و شوك\nعذبوك و بنيك طردوك و نفوك\nعجبا كيف صمدت ضد كفران و شرك\n\nكم قسى الظلم عليكي كم سعى الموت إليك\nكم صدمت باضطهادات و تعذيب و ضنك\n\n2- هو صوت ظل يدوي دائما في أذنيك\nيشعل القوة فيك حين قال الله عنك\nإن أبواب الجحيم سوف لا تقوى عليك\n\nكم قسى الظلم عليكي كم سعى الموت إليك\nكم صدمت باضطهادات و تعذيب و ضنك\n\n3- لست في ارض ولدت قد ولدت في السماء\nأنت من روح طهور لست من طين وماء\nأنت حق أنت قدس أنت نور و ضياء\n\nكم قسى الظلم عليكي كم سعى الموت إليك\nكم صدمت باضطهادات و تعذيب و ضنك\n\n4- من بناك هل بناك غير رب الشهداء\nمن رواك هل رواك غير ينبوع الدماء\nمن حماك هل حماك غير اقنوم الفداء\n\nكم قسى الظلم عليكي كم سعى الموت إليك\nكم صدمت باضطهادات و تعذيب و ضنك\n\n5- إسألى عهد المعز فهو بالخبرة يعلم\nاسأليه كيف بالإيمان حركت المقطم\nجبل قد هز منك و إذا شئت تحطم\n\nكم قسى الظلم عليكي كم سعى الموت إليك\nكم صدمت باضطهادات و تعذيب و ضنك\n\n6- أيها الناس رويدا قلب التاريخ تفهم\nقل لمن يدعى عظيما إن رب المجد اعظم\nكل قبطي وديع إنما في الحق ضيغم\n\nكم قسى الظلم عليكي كم سعى الموت إليك\nكم صدمت باضطهادات و تعذيب و ضنك\n\n7- و هو يعطى الروح أيضا قائلا في غير شك\nإن أبواب الجحيم سوف لا تقوى عليك\nفإطمئنى و استريحى إنما المصلوب معك\n\nكم قسى الظلم عليكي كم سعى الموت إليك\nكم صدمت باضطهادات و تعذيب و ضنك\n\n';
const SO2_10 =
    '١.أعروس الفادي القبطية\nوضياء بلادي المصرية\nبمحبة قلبي النارية\nأهواكِ يا أرثوذكسية\n\nأم الشهداء جميلة\nأم الشرفاء نبيلة\nعبرت بحر الألامات\nحفظت بدماها الحق قويمَ\n\n٢.يا أمي حبك أحياني\nآلامك بذرة إيماني\nقد جزت يا أمي الأزمان\nوخرجت خروج الشجعان\n\nأم الشهداء جميلة\nأم الشرفاء نبيلة\nعبرت بحر الألامات\nحفظت بدماها الحق قويمَ\n\n٣.ضربوكِ الأعداء طردوكِ\nسجنوكِ وأيضاً قتلوكِ\nوطعام وحوش جعلوكِ\nولكل عذاب دفعوكِ\n\nأم الشهداء جميلة\nأم الشرفاء نبيلة\nعبرت بحر الألامات\nحفظت بدماها الحق قويمَ\n\n٤.يا أمي كم كنتِ أمينة\nوبحب عريسك مفتونة\nأسراره عندِك مكنونة\nوبقوته أنتِ مصونة\n\nأم الشهداء جميلة\nأم الشرفاء نبيلة\nعبرت بحر الألامات\nحفظت بدماها الحق قويمَ\n\n٥.ما أحلى أمي المطرودة\nمن أجل الفادي وعبيده\nسعده معطيكِ وداده\nمن ينهض بيعة أجداده\n\nأم الشهداء جميلة\nأم الشرفاء نبيلة\nعبرت بحر الألامات\nحفظت بدماها الحق قويمَ\n\n٦.يا ليت فؤادي يهواكِ\nكي أحيا في ظل حماكٍ\nوأطارد دوماً أعداكِ\nوأجدد أيام صباكِ\n\nأم الشهداء جميلة\nأم الشرفاء نبيلة\nعبرت بحر الألامات\nحفظت بدماها الحق قويمَ\n\n٧.يا أمي آثارك في الوادي\nوحنانك يغلي في فؤادي\nها عهد فؤادي وودادي\nأن أخدم بيعة أجدادي\n\nأم الشهداء جميلة\nأم الشرفاء نبيلة\nعبرت بحر الألامات\nحفظت بدماها الحق قويمَ\n\n';
